# df.dropna
# df.fillna
#### to make the change occur use inplace = True

In [4]:
import numpy as np
import pandas as pd

# Adding into Dataframe by pd.DataFrame(dictionary)

In [5]:
d = {'A':[1,2, np.nan],'B': [5, np.nan, np.nan],'C': [1,2,3]}

In [6]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## Dropping Nan

In [7]:
df.dropna()
# #axis : {0 or 'index', 1 or 'columns'}, default 0
#     Determine if rows or columns which contain missing values are
#     removed.

#     * 0, or 'index' : Drop rows which contain missing values.
#     * 1, or 'columns' : Drop columns which contain missing value.

     A    B  C
0  1.0  5.0  1

In [11]:
df.dropna(axis=1) #dropping colun that is null

   C
0  1
1  2
2  3

In [13]:
df.dropna(thresh=2)
#at least many x value that is not null
#if not set then if there is null value => drop

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [17]:
df.dropna(axis=1, thresh= 2)
#dropna based on column

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [18]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#  Fill in missing value

In [15]:
df.fillna(value= "FILL IN VALUE")

               A              B  C
0            1.0            5.0  1
1            2.0  FILL IN VALUE  2
2  FILL IN VALUE  FILL IN VALUE  3

In [19]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [20]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3